Tekla.Structures.Model.RebarLapping.LapSideEnum
The side of the split that the lap is located.

Tekla.Structures.Model.RebarLapping.LapSideEnum.LAP_LEFT
Lap left.

Tekla.Structures.Model.RebarLapping.LapSideEnum.LAP_RIGHT
Lap right.

Tekla.Structures.Model.RebarLapping.LapSideEnum.LAP_MIDDLE
Lap middle.